---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviserRuleId.#ctor(System.Guid)
source: html/97acf826-6430-b7af-d99b-fc9093ff0cfc.htm
---
# Autodesk.Revit.DB.PerformanceAdviserRuleId.#ctor Method

Creates a new PerformanceAdviserRuleId instance.

## Syntax (C#)
```csharp
public PerformanceAdviserRuleId(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the PerformanceAdviserRuleId.